Repository: bounswe/bounswe2025group4
Catalog: apps/jobboard-mobile/lib/l10n/app_*.arb
Languages: ar, tr

# mentorScreen_requestAccepted
source: Request accepted
ar: تم قبول الطلب
tr: Talep kabul edildi

# mentorScreen_requestRejected
source: Request rejected
ar: تم رفض الطلب
tr: Talep reddedildi

# mentorScreen_mentorshipCompleted
source: Mentorship completed successfully
ar: تم إكمال الترابط المهني بنجاح
tr: Mentorluk başarıyla tamamlandı

# mentorScreen_mentorshipCancelled
source: Mentorship cancelled successfully
ar: تم إلغاء الترابط المهني بنجاح
tr: Mentorluk başarıyla iptal edildi

# mentorScreen_openChat
source: Open chat with {menteeName}
ar: فتح الدردشة مع {menteeName}
tr: {menteeName} ile sohbet aç

# mentorScreen_updateCapacityTitle
source: Update Maximum Mentee Capacity
ar: تحديث الحد الأقصى لسعة المنتسبين
tr: Maksimum Menti Kapasitesini Güncelle

# mentorScreen_maxMentees
source: Maximum number of mentees
ar: الحد الأقصى لعدد المنتسبين
tr: Maksimum menti sayısı

# mentorScreen_enterNumber
source: Enter a number
ar: أدخل رقماً
tr: Bir sayı girin

# mentorScreen_cancel
source: Cancel
ar: إلغاء
tr: İptal

# mentorScreen_update
source: Update
ar: تحديث
tr: Güncelle

# mentorScreen_completeMentorship
source: complete Mentorship
ar: إكمال الترابط المهني
tr: Mentorluğu tamamla

# mentorScreen_cancelMentorship
source: cancel Mentorship
ar: إلغاء الترابط المهني
tr: Mentorluğu iptal et

# mentorScreen_confirmComplete
source: Are you sure you want to complete your mentorship with {menteeName}? This will mark the mentorship as successfully completed.
ar: هل أنت متأكد من أنك تريد إكمال الترابط المهني مع {menteeName}؟ سيؤدي هذا إلى تمييز الترابط المهني كمكتمل بنجاح.
tr: {menteeName} ile mentorluğunuzu tamamlamak istediğinizden emin misiniz? Bu, mentorluğu başarıyla tamamlanmış olarak işaretleyecektir.

# mentorScreen_confirmCancel
source: Are you sure you want to cancel your mentorship with {menteeName}? This will end the mentorship relationship.
ar: هل أنت متأكد من أنك تريد إلغاء الترابط المهني مع {menteeName}؟ سيؤدي هذا إلى إنهاء علاقة الترابط المهني.
tr: {menteeName} ile mentorluğunuzu iptal etmek istediğinizden emin misiniz? Bu, mentorluk ilişkisini sona erdirecektir.

# mentorScreen_confirm
source: Confirm
ar: تأكيد
tr: Onayla

# menteeScreen_findMentors
source: Find Mentors
ar: البحث عن المرشدين
tr: Mentor Bul

# menteeScreen_myMentorships
source: My Mentorships
ar: ترابطاتي المهنية
tr: Mentorluklarım

# menteeScreen_searchMentors
source: Search mentors by name, role, company...
ar: البحث عن المرشدين بالاسم، الدور، الشركة...
tr: Mentorları isim, rol, şirket ile ara...

# menteeScreen_noMentorsFound
source: No mentors found.
ar: لم يتم العثور على مرشدين.
tr: Mentor bulunamadı.

# menteeScreen_errorLoadingMentors
source: Error loading mentors: {error}
ar: خطأ في تحميل المرشدين: {error}
tr: Mentorlar yüklenirken hata: {error}

# menteeScreen_retryLoadingMentors
source: Retry Loading Mentors
ar: إعادة تحميل المرشدين
tr: Mentorları Tekrar Yükle

# menteeScreen_requestMentorshipTitle
source: Request Mentorship from {mentorName}
ar: طلب ترابط مهني من {mentorName}
tr: {mentorName} ile Mentorluk Talep Et

# menteeScreen_provideMessage
source: Please provide a message for your mentorship request:
ar: الرجاء تقديم رسالة لطلب الترابط المهني:
tr: Lütfen mentorluk talebiniz için bir mesaj sağlayın:

# menteeScreen_messageHint
source: I would like you to be my mentor because...
ar: أريدك أن تكون مرشدي لأن...
tr: Benim mentorum olmanı istiyorum çünkü...

# menteeScreen_sendRequest
source: Send Request
ar: إرسال الطلب
tr: Talebi Gönder

# menteeScreen_messageMinLength
source: Please enter a message of at least 10 characters
ar: الرجاء إدخال رسالة من 10 أحرف على الأقل
tr: Lütfen en az 10 karakter uzunluğunda bir mesaj girin

# menteeScreen_requestSent
source: Mentorship requested for {mentorName}
ar: تم طلب الترابط المهني لـ {mentorName}
tr: {mentorName} için mentorluk talep edildi

# menteeScreen_requestError
source: There is an error while requesting
ar: حدث خطأ أثناء الطلب
tr: Talep ederken bir hata oluştu

# menteeScreen_pendingRequests
source: Pending Requests
ar: الطلبات المعلقة
tr: Bekleyen Talepler

# menteeScreen_activeMentorships
source: Active Mentorships
ar: الترابطات المهنية النشطة
tr: Aktif Mentorluklar

# menteeScreen_noPendingRequests
source: No pending requests.
ar: لا توجد طلبات معلقة.
tr: Bekleyen talep yok.

# menteeScreen_noActiveMentorships
source: No active mentorships.
ar: لا توجد ترابطات مهنية نشطة.
tr: Aktif mentorluk yok.

# menteeScreen_error
source: Error: {error}
ar: خطأ: {error}
tr: Hata: {error}

# mentorProfile_title
source: Mentor Profile: {mentorName}
ar: ملف المرشد: {mentorName}
tr: Mentor Profili: {mentorName}

# mentorProfile_loadError
source: Failed to load mentor profile or reviews: {error}
ar: فشل تحميل ملف المرشد أو المراجعات: {error}
tr: Mentor profili veya yorumları yüklenemedi: {error}

# mentorProfile_noProfileData
source: No profile data available
ar: لا توجد بيانات ملف متاحة
tr: Profil verisi mevcut değil

# mentorProfile_rateMentor
source: Rate this mentor
ar: تقييم هذا المرشد
tr: Bu mentoru değerlendir

# mentorProfile_atCompany
source: at {company}
ar: في {company}
tr: {company} şirketinde

# mentorProfile_rating
source: Rating
ar: التقييم
tr: Değerlendirme

# mentorProfile_reviews
source: {count} reviews
ar: {count} مراجعة
tr: {count} yorum

# mentorProfile_mentorshipInfo
source: Mentorship Information
ar: معلومات الترابط المهني
tr: Mentorluk Bilgileri

# mentorProfile_capacity
source: Capacity
ar: السعة
tr: Kapasite

# mentorProfile_mentees
source: {current}/{max} mentees
ar: {current}/{max} منتسب
tr: {current}/{max} menti

# mentorProfile_status
source: Status
ar: الحالة
tr: Durum

# mentorProfile_available
source: Available for mentorship
ar: متاح للترابط المهني
tr: Mentorluk için müsait

# mentorProfile_notAvailable
source: Not available for mentorship
ar: غير متاح للترابط المهني
tr: Mentorluk için müsait değil

# mentorProfile_about
source: About
ar: حول
tr: Hakkında

# mentorProfile_noReviews
source: No reviews yet.
ar: لا توجد مراجعات بعد.
tr: Henüz yorum yok.

# mentorProfile_byUser
source: By: {username}
ar: بواسطة: {username}
tr: Yazan: {username}

# mentorProfile_rateTitle
source: Rate {mentorName}
ar: تقييم {mentorName}
tr: {mentorName} Değerlendir

# mentorProfile_selectRating
source: Select a rating:
ar: اختر تقييماً:
tr: Bir değerlendirme seçin:

# mentorProfile_commentOptional
source: Comment (optional)
ar: تعليق (اختياري)
tr: Yorum (isteğe bağlı)

# mentorProfile_submitting
source: Submitting...
ar: جاري الإرسال...
tr: Gönderiliyor...

# mentorProfile_submit
source: Submit
ar: إرسال
tr: Gönder

# mentorProfile_selectRatingError
source: Please select a rating
ar: الرجاء اختيار تقييم
tr: Lütfen bir değerlendirme seçin

# mentorProfile_ratingSubmitted
source: Rating submitted successfully
ar: تم إرسال التقييم بنجاح
tr: Değerlendirme başarıyla gönderildi

# mentorProfile_ratingError
source: Error submitting rating: {error}
ar: خطأ في إرسال التقييم: {error}
tr: Değerlendirme gönderilirken hata: {error}

# directMessage_attachFile
source: Attach file
ar: إرفاق ملف
tr: Dosya ekle

# directMessage_typeMessage
source: Type a message...
ar: اكتب رسالة...
tr: Mesaj yazın...

# directMessage_sendMessage
source: Send message
ar: إرسال رسالة
tr: Mesaj gönder

# directMessage_fileNotImplemented
source: File attachment not implemented yet.
ar: إرفاق الملفات لم يتم تطبيقه بعد.
tr: Dosya ekleme henüz uygulanmadı.

# createJob_title
source: Create New Job Posting
ar: إنشاء إعلان وظيفة جديد
tr: Yeni İş İlanı Oluştur

# createJob_jobDetails
source: Job Details
ar: تفاصيل الوظيفة
tr: İş Detayları

# createJob_jobTitle
source: Job Title
ar: عنوان الوظيفة
tr: İş Başlığı

# createJob_jobTitleRequired
source: Please enter a job title
ar: الرجاء إدخال عنوان الوظيفة
tr: Lütfen bir iş başlığı girin

# createJob_company
source: Company
ar: الشركة
tr: Şirket

# createJob_companyHint
source: Your Company Name
ar: اسم شركتك
tr: Şirket Adınız

# createJob_companyRequired
source: Please enter the company name
ar: الرجاء إدخال اسم الشركة
tr: Lütfen şirket adını girin

# createJob_location
source: Location (e.g., City, State, Country)
ar: الموقع (مثل: المدينة، الولاية، البلد)
tr: Konum (örn. Şehir, Eyalet, Ülke)

# createJob_locationRequired
source: Please enter a location
ar: الرجاء إدخال موقع
tr: Lütfen bir konum girin

# createJob_remoteJob
source: Remote Job
ar: وظيفة عن بُعد
tr: Uzaktan İş

# createJob_description
source: Job Description
ar: وصف الوظيفة
tr: İş Açıklaması

# createJob_descriptionRequired
source: Please enter a job description
ar: الرجاء إدخال وصف الوظيفة
tr: Lütfen bir iş açıklaması girin

# createJob_jobType
source: Job Type
ar: نوع الوظيفة
tr: İş Türü

# createJob_selectJobType
source: Select Job Type
ar: اختر نوع الوظيفة
tr: İş Türü Seçin

# createJob_jobTypeRequired
source: Please select a job type
ar: الرجاء اختيار نوع الوظيفة
tr: Lütfen bir iş türü seçin

# createJob_contactInfo
source: Contact Information (Email/Phone/Link)
ar: معلومات الاتصال (البريد الإلكتروني/الهاتف/الرابط)
tr: İletişim Bilgileri (E-posta/Telefon/Bağlantı)

# createJob_contactInfoRequired
source: Please provide contact information
ar: الرجاء تقديم معلومات الاتصال
tr: Lütfen iletişim bilgilerini sağlayın

# createJob_minSalary
source: Minimum Salary (Optional)
ar: الحد الأدنى للراتب (اختياري)
tr: Minimum Maaş (İsteğe Bağlı)

# createJob_minSalaryHint
source: e.g., 50000
ar: مثل: 50000
tr: örn. 50000

# createJob_maxSalary
source: Maximum Salary (Optional)
ar: الحد الأقصى للراتب (اختياري)
tr: Maksimum Maaş (İsteğe Bağlı)

# createJob_maxSalaryHint
source: e.g., 70000
ar: مثل: 70000
tr: örn. 70000

# createJob_validNumber
source: Please enter a valid number
ar: الرجاء إدخال رقم صحيح
tr: Lütfen geçerli bir sayı girin

# createJob_invalidFormat
source: Invalid number format (too many decimal points)
ar: تنسيق رقم غير صحيح (نقاط عشرية كثيرة جداً)
tr: Geçersiz sayı formatı (çok fazla ondalık nokta)

# createJob_maxSalaryError
source: Max salary must be >= min salary
ar: الحد الأقصى للراتب يجب أن يكون >= الحد الأدنى للراتب
tr: Maksimum maaş >= minimum maaş olmalıdır

# createJob_ethicalPolicies
source: Ethical Policies Compliance
ar: الامتثال للسياسات الأخلاقية
tr: Etik Politikalar Uyumu

# createJob_creatingPost
source: Creating Post...
ar: جاري إنشاء الإعلان...
tr: İlan Oluşturuluyor...

# createJob_createPost
source: Create Job Post
ar: إنشاء إعلان وظيفة
tr: İş İlanı Oluştur

# createJob_selectJobTypeError
source: Please select a job type.
ar: الرجاء اختيار نوع الوظيفة.
tr: Lütfen bir iş türü seçin.

# createJob_selectPolicyError
source: Please select at least one ethical policy.
ar: الرجاء اختيار سياسة أخلاقية واحدة على الأقل.
tr: Lütfen en az bir etik politika seçin.

# createJob_employerError
source: Error: Could not verify employer account.
ar: خطأ: لا يمكن التحقق من حساب صاحب العمل.
tr: Hata: İşveren hesabı doğrulanamadı.

# createJob_invalidMinSalary
source: Invalid minimum salary format. Please enter numbers only.
ar: تنسيق الحد الأدنى للراتب غير صحيح. الرجاء إدخال أرقام فقط.
tr: Geçersiz minimum maaş formatı. Lütfen sadece sayı girin.

# createJob_invalidMaxSalary
source: Invalid maximum salary format. Please enter numbers only.
ar: تنسيق الحد الأقصى للراتب غير صحيح. الرجاء إدخال أرقام فقط.
tr: Geçersiz maksimum maaş formatı. Lütfen sadece sayı girin.

# createJob_salaryRangeError
source: Minimum salary cannot be greater than maximum salary.
ar: الحد الأدنى للراتب لا يمكن أن يكون أكبر من الحد الأقصى للراتب.
tr: Minimum maaş maksimum maaştan büyük olamaz.

# createJob_success
source: Job "{jobTitle}" created successfully!
ar: تم إنشاء الوظيفة "{jobTitle}" بنجاح!
tr: İş "{jobTitle}" başarıyla oluşturuldu!

# createJob_error
source: Error creating job: {error}
ar: خطأ في إنشاء الوظيفة: {error}
tr: İş oluşturulurken hata: {error}

# jobApplications_title
source: Job Applications
ar: طلبات الوظائف
tr: İş Başvuruları

# jobApplications_userError
source: User not logged in or user ID not found.
ar: المستخدم غير مسجل الدخول أو لم يتم العثور على معرف المستخدم.
tr: Kullanıcı giriş yapmamış veya kullanıcı kimliği bulunamadı.

# jobApplications_loadError
source: Failed to load applications. Please try again.
ar: فشل تحميل الطلبات. الرجاء المحاولة مرة أخرى.
tr: Başvurular yüklenemedi. Lütfen tekrar deneyin.

# jobApplications_noApplications
source: No applications received for this job yet.
ar: لم يتم استلام أي طلبات لهذه الوظيفة بعد.
tr: Bu iş için henüz başvuru alınmadı.

# jobApplications_applied
source: Applied: {date}
ar: تم التقديم: {date}
tr: Başvuru: {date}

# jobApplications_feedback
source: Feedback: {feedback}
ar: التعليقات: {feedback}
tr: Geri Bildirim: {feedback}

# jobApplications_reject
source: Reject
ar: رفض
tr: Reddet

# jobApplications_approve
source: Approve
ar: موافقة
tr: Onayla

# jobApplications_statusUpdated
source: Application {status}.
ar: تم {status} الطلب.
tr: Başvuru {status}.

# jobApplications_updateError
source: Error updating status: {error}
ar: خطأ في تحديث الحالة: {error}
tr: Durum güncellenirken hata: {error}

# jobApplications_feedbackTitle
source: Provide Feedback (Optional) for {action}
ar: تقديم تعليقات (اختياري) لـ {action}
tr: {action} için Geri Bildirim Sağla (İsteğe Bağlı)

# jobApplications_feedbackHint
source: Enter feedback here...
ar: أدخل التعليقات هنا...
tr: Geri bildirimi buraya girin...

# jobApplications_submit
source: Submit
ar: إرسال
tr: Gönder

# jobFilter_title
source: Filter Jobs
ar: تصفية الوظائف
tr: İşleri Filtrele

# jobFilter_jobTitle
source: Job Title
ar: عنوان الوظيفة
tr: İş Başlığı

# jobFilter_jobTitleHint
source: Enter job title prefix
ar: أدخل بادئة عنوان الوظيفة
tr: İş başlığı öneki girin

# jobFilter_companyName
source: Company Name
ar: اسم الشركة
tr: Şirket Adı

# jobFilter_companyNameHint
source: Enter company name prefix
ar: أدخل بادئة اسم الشركة
tr: Şirket adı öneki girin

# jobFilter_ethicalPolicies
source: Ethical Policies
ar: السياسات الأخلاقية
tr: Etik Politikalar

# jobFilter_minSalary
source: Min Salary
ar: الحد الأدنى للراتب
tr: Min Maaş

# jobFilter_minSalaryHint
source: e.g., 30000
ar: مثل: 30000
tr: örn. 30000

# jobFilter_maxSalary
source: Max Salary
ar: الحد الأقصى للراتب
tr: Max Maaş

# jobFilter_maxSalaryHint
source: e.g., 100000
ar: مثل: 100000
tr: örn. 100000

# jobFilter_remoteOnly
source: Remote Jobs Only
ar: الوظائف عن بُعد فقط
tr: Sadece Uzaktan İşler

# jobFilter_jobType
source: Job Type
ar: نوع الوظيفة
tr: İş Türü

# jobFilter_clearAll
source: Clear All
ar: مسح الكل
tr: Tümünü Temizle

# jobFilter_applyFilters
source: Apply Filters
ar: تطبيق المرشحات
tr: Filtreleri Uygula

# myApplications_title
source: My Job Applications
ar: طلبات الوظائف الخاصة بي
tr: İş Başvurularım

# myApplications_userError
source: Error: User not found. Cannot load applications.
ar: خطأ: لم يتم العثور على المستخدم. لا يمكن تحميل الطلبات.
tr: Hata: Kullanıcı bulunamadı. Başvurular yüklenemiyor.

# myApplications_loadError
source: Failed to load applications. Please try again.
ar: فشل تحميل الطلبات. الرجاء المحاولة مرة أخرى.
tr: Başvurular yüklenemedi. Lütfen tekrar deneyin.

# myApplications_noApplications
source: You have not applied to any jobs yet.
ar: لم تتقدم لأي وظيفة بعد.
tr: Henüz hiçbir işe başvurmadınız.

# myApplications_applied
source: Applied: {date}
ar: تم التقديم: {date}
tr: Başvuru: {date}

# myApplications_specialNeeds
source: Special Needs: {specialNeeds}
ar: الاحتياجات الخاصة: {specialNeeds}
tr: Özel İhtiyaçlar: {specialNeeds}

# myApplications_feedback
source: Feedback: {feedback}
ar: التعليقات: {feedback}
tr: Geri Bildirim: {feedback}

# myApplications_feedbackTitle
source: Feedback for {jobTitle}
ar: تعليقات لـ {jobTitle}
tr: {jobTitle} için Geri Bildirim

# myApplications_close
source: Close
ar: إغلاق
tr: Kapat

# workplaces_title
source: Workplaces
ar: أماكن العمل
tr: İş Yerleri

# workplaces_reviews
source: {count} reviews
ar: {count} مراجعة
tr: {count} yorum

# editProfile_title
source: Edit Profile
ar: تعديل الملف الشخصي
tr: Düzenle

# editProfile_saveChanges
source: Save changes
ar: حفظ التغييرات
tr: Değişiklikleri kaydet

# editProfile_personalInfo
source: Personal Information
ar: المعلومات الشخصية
tr: Kişisel Bilgiler

# editProfile_fullName
source: Full Name
ar: الاسم الكامل
tr: Ad Soyad

# editProfile_bio
source: Bio
ar: السيرة الذاتية
tr: Biyografi

# editProfile_location
source: Location
ar: الموقع
tr: Konum

# editProfile_phone
source: Phone
ar: الهاتف
tr: Telefon

# editProfile_occupation
source: Occupation
ar: المهنة
tr: Meslek

# editProfile_accountInfo
source: Account Information
ar: معلومات الحساب
tr: Hesap Bilgileri

# editProfile_username
source: Username
ar: اسم المستخدم
tr: Kullanıcı Adı

# editProfile_email
source: Email
ar: البريد الإلكتروني
tr: E-posta

# editProfile_workExperience
source: Work Experience
ar: الخبرة العملية
tr: İş Deneyimi

# editProfile_education
source: Education
ar: التعليم
tr: Eğitim

# editProfile_addWorkExperience
source: Add Work Experience
ar: إضافة خبرة عمل
tr: İş Deneyimi Ekle

# editProfile_addEducation
source: Add Education
ar: إضافة تعليم
tr: Eğitim Ekle

# userProfile_title
source: User Profile
ar: الملف الشخصي للمستخدم
tr: Kullanıcı Profili

# userProfile_loadError
source: Failed to load user profile
ar: فشل تحميل الملف الشخصي للمستخدم
tr: Kullanıcı profili yüklenemedi

# userProfile_tryAgain
source: Try Again
ar: حاول مرة أخرى
tr: Tekrar Dene

# userProfile_workExperience
source: Work Experience
ar: الخبرة العملية
tr: İş Deneyimi

# userProfile_education
source: Education
ar: التعليم
tr: Eğitim

# userProfile_noWorkExperience
source: No work experience added yet
ar: لم يتم إضافة خبرة عمل بعد
tr: Henüz iş deneyimi eklenmemiş

# userProfile_noEducation
source: No education added yet
ar: لم يتم إضافة تعليم بعد
tr: Henüz eğitim eklenmemiş

# userProfile_skills
source: Skills
ar: المهارات
tr: Yetenekler

# userProfile_interests
source: Interests
ar: الاهتمامات
tr: İlgi Alanları

# profilePage_username
source: Username: {username}
ar: اسم المستخدم: {username}
tr: Kullanıcı Adı: {username}

# profilePage_email
source: Email: {email}
ar: البريد الإلكتروني: {email}
tr: E-posta: {email}

# profilePage_skills
source: Skills
ar: المهارات
tr: Yetenekler

# profilePage_noSkills
source: No skills added yet.
ar: لم يتم إضافة مهارات بعد.
tr: Henüz yetenek eklenmemiş.

# profilePage_addSkill
source: Add Skill
ar: إضافة مهارة
tr: Yetenek Ekle

# profilePage_enterSkill
source: Enter a skill
ar: أدخل مهارة
tr: Bir yetenek girin

# profilePage_interests
source: Interests
ar: الاهتمامات
tr: İlgi Alanları

# profilePage_noInterests
source: No interests added yet.
ar: لم يتم إضافة اهتمامات بعد.
tr: Henüz ilgi alanı eklenmemiş.

# profilePage_addInterest
source: Add Interest
ar: إضافة اهتمام
tr: İlgi Alanı Ekle

# profilePage_enterInterest
source: Enter an interest
ar: أدخل اهتمام
tr: Bir ilgi alanı girin

# profilePage_theme
source: Theme
ar: السمة
tr: Tema

# profilePage_lightMode
source: Light
ar: فاتح
tr: Açık

# profilePage_darkMode
source: Dark
ar: داكن
tr: Koyu

# profilePage_systemMode
source: System
ar: النظام
tr: Sistem

# profilePage_themeChanged
source: Theme changed to {theme}
ar: تم تغيير السمة إلى {theme}
tr: Tema {theme} olarak değiştirildi

# profilePage_fontSize
source: Font Size
ar: حجم الخط
tr: Yazı Boyutu

# profilePage_small
source: Small
ar: صغير
tr: Küçük

# profilePage_medium
source: Medium
ar: متوسط
tr: Orta

# profilePage_large
source: Large
ar: كبير
tr: Büyük

# profileWidgets_education
source: Education
ar: التعليم
tr: Eğitim

# profileWidgets_add
source: Add
ar: إضافة
tr: Ekle

# profileWidgets_noEducation
source: No education history added yet.
ar: لم يتم إضافة تاريخ تعليمي بعد.
tr: Henüz eğitim geçmişi eklenmemiş.

# profileWidgets_deleteEducation
source: Delete Education
ar: حذف التعليم
tr: Eğitimi Sil

# profileWidgets_confirmDeleteEducation
source: Are you sure you want to delete your education at {school}?
ar: هل أنت متأكد من أنك تريد حذف تعليمك في {school}؟
tr: {school} okulundaki eğitiminizi silmek istediğinizden emin misiniz?

# profileWidgets_cancel
source: Cancel
ar: إلغاء
tr: İptal

# profileWidgets_delete
source: Delete
ar: حذف
tr: Sil

# profileWidgets_workExperience
source: Work Experience
ar: الخبرة العملية
tr: İş Deneyimi

# profileWidgets_noWorkExperience
source: No work experience added yet.
ar: لم يتم إضافة خبرة عمل بعد.
tr: Henüz iş deneyimi eklenmemiş.

# profileWidgets_deleteExperience
source: Delete Experience
ar: حذف الخبرة
tr: Deneyimi Sil

# profileWidgets_confirmDeleteExperience
source: Are you sure you want to delete your experience at {company}?
ar: هل أنت متأكد من أنك تريد حذف خبرتك في {company}؟
tr: {company} şirketindeki deneyiminizi silmek istediğinizden emin misiniz?

# educationDialog_addTitle
source: Add Education
ar: إضافة تعليم
tr: Eğitim Ekle

# educationDialog_editTitle
source: Edit Education
ar: تعديل التعليم
tr: Eğitimi Düzenle

# educationDialog_school
source: School/University
ar: المدرسة/الجامعة
tr: Okul/Üniversite

# educationDialog_schoolRequired
source: Please enter a school name
ar: الرجاء إدخال اسم المدرسة
tr: Lütfen bir okul adı girin

# educationDialog_degree
source: Degree
ar: الدرجة
tr: Derece

# educationDialog_degreeRequired
source: Please enter a degree
ar: الرجاء إدخال درجة
tr: Lütfen bir derece girin

# educationDialog_field
source: Field of Study
ar: مجال الدراسة
tr: Çalışma Alanı

# educationDialog_fieldRequired
source: Please enter a field of study
ar: الرجاء إدخال مجال الدراسة
tr: Lütfen bir çalışma alanı girin

# educationDialog_startDate
source: Start Date (MM/YYYY)
ar: تاريخ البداية (شهر/سنة)
tr: Başlangıç Tarihi (AA/YYYY)

# educationDialog_startDateRequired
source: Please enter a start date
ar: الرجاء إدخال تاريخ البداية
tr: Lütfen bir başlangıç tarihi girin

# educationDialog_currentlyStudying
source: I am currently studying here
ar: أدرس حالياً هنا
tr: Şu anda burada okuyorum

# educationDialog_endDate
source: End Date (MM/YYYY)
ar: تاريخ النهاية (شهر/سنة)
tr: Bitiş Tarihi (AA/YYYY)

# educationDialog_endDateRequired
source: Please enter an end date
ar: الرجاء إدخال تاريخ النهاية
tr: Lütfen bir bitiş tarihi girin

# educationDialog_save
source: Save
ar: حفظ
tr: Kaydet

# workExperienceDialog_addTitle
source: Add Work Experience
ar: إضافة خبرة عمل
tr: İş Deneyimi Ekle

# workExperienceDialog_editTitle
source: Edit Work Experience
ar: تعديل الخبرة العملية
tr: İş Deneyimini Düzenle

# workExperienceDialog_company
source: Company
ar: الشركة
tr: Şirket

# workExperienceDialog_companyRequired
source: Please enter a company name
ar: الرجاء إدخال اسم الشركة
tr: Lütfen bir şirket adı girin

# workExperienceDialog_position
source: Position
ar: المنصب
tr: Pozisyon

# workExperienceDialog_positionRequired
source: Please enter a position
ar: الرجاء إدخال المنصب
tr: Lütfen bir pozisyon girin

# workExperienceDialog_startDate
source: Start Date (MM/YYYY)
ar: تاريخ البداية (شهر/سنة)
tr: Başlangıç Tarihi (AA/YYYY)

# workExperienceDialog_startDateRequired
source: Please enter a start date
ar: الرجاء إدخال تاريخ البداية
tr: Lütfen bir başlangıç tarihi girin

# workExperienceDialog_currentlyWorking
source: I currently work here
ar: أعمل حالياً هنا
tr: Şu anda burada çalışıyorum

# workExperienceDialog_endDate
source: End Date (MM/YYYY)
ar: تاريخ النهاية (شهر/سنة)
tr: Bitiş Tarihi (AA/YYYY)

# workExperienceDialog_endDateRequired
source: Please enter an end date
ar: الرجاء إدخال تاريخ النهاية
tr: Lütfen bir bitiş tarihi girin

# workExperienceDialog_description
source: Description
ar: الوصف
tr: Açıklama

# workExperienceDialog_descriptionRequired
source: Please enter a description
ar: الرجاء إدخال وصف
tr: Lütfen bir açıklama girin

# workExperienceDialog_save
source: Save
ar: حفظ
tr: Kaydet

# badges_title
source: Achievements & Badges
ar: الإنجازات والشارات
tr: Başarılar ve Rozetler

# badges_noBadges
source: No badges earned yet.
ar: لم يتم كسب أي شارات بعد.
tr: Henüz rozet kazanılmamış.
