Repository: bounswe/bounswe2025group4
Catalog: apps/jobboard-mobile/lib/l10n/app_*.arb
Languages: ar, tr

# badges_earned
source: Earned {date}
ar: تم كسبها في {date}
tr: {date} tarihinde kazanıldı

# badges_today
source: today
ar: اليوم
tr: bugün

# badges_yesterday
source: yesterday
ar: أمس
tr: dün

# badges_daysAgo
source: {days} days ago
ar: منذ {days} أيام
tr: {days} gün önce

# badges_monthsAgo
source: {months} {monthText} ago
ar: منذ {months} {monthText}
tr: {months} {monthText} önce

# badges_yearsAgo
source: {years} {yearText} ago
ar: منذ {years} {yearText}
tr: {years} {yearText} önce

# badges_month
source: month
ar: شهر
tr: ay

# badges_months
source: months
ar: أشهر
tr: ay

# badges_year
source: year
ar: سنة
tr: yıl

# badges_years
source: years
ar: سنوات
tr: yıl

# common_notSpecified
source: Not specified
ar: غير محدد
tr: Belirtilmemiş

# common_upTo
source: Up to {amount}
ar: حتى {amount}
tr: {amount} kadar

# common_from
source: From {amount}
ar: من {amount}
tr: {amount}'den başlayarak

# common_darkMode
source: Dark Mode
ar: الوضع المظلم
tr: Karanlık Mod

# common_lightMode
source: Light Mode
ar: الوضع المضيء
tr: Aydınlık Mod

# common_themeToggle
source: Toggle Theme
ar: تبديل المظهر
tr: Tema Değiştir

# common_darkModeIcon
source: Dark mode icon
ar: أيقونة الوضع المظلم
tr: Karanlık mod ikonu

# common_lightModeIcon
source: Light mode icon
ar: أيقونة الوضع المضيء
tr: Aydınlık mod ikonu

# common_back
source: Back
ar: رجوع
tr: Geri

# common_showPassword
source: Show password
ar: إظهار كلمة المرور
tr: Şifreyi göster

# common_hidePassword
source: Hide password
ar: إخفاء كلمة المرور
tr: Şifreyi gizle

# createJob_invalidMinSalaryFormat
source: Invalid minimum salary format. Please enter whole numbers only.
ar: تنسيق الحد الأدنى للراتب غير صحيح. الرجاء إدخال أرقام كاملة فقط.
tr: Geçersiz minimum maaş formatı. Lütfen sadece tam sayı girin.

# createJob_invalidMaxSalaryFormat
source: Invalid maximum salary format. Please enter whole numbers only.
ar: تنسيق الحد الأقصى للراتب غير صحيح. الرجاء إدخال أرقام كاملة فقط.
tr: Geçersiz maksimum maaş formatı. Lütfen sadece tam sayı girin.

# createJob_salaryRangeInvalid
source: Minimum salary cannot be greater than maximum salary.
ar: الحد الأدنى للراتب لا يمكن أن يكون أكبر من الحد الأقصى للراتب.
tr: Minimum maaş maksimum maaştan büyük olamaz.

# createJob_companyNameRequired
source: Please enter the company name
ar: الرجاء إدخال اسم الشركة
tr: Lütfen şirket adını girin

# createJob_locationLabel
source: Location (e.g., City, State, Country)
ar: الموقع (مثل: المدينة، الولاية، البلد)
tr: Konum (örn. Şehir, Eyalet, Ülke)

# createJob_locationRequiredError
source: Please enter a location
ar: الرجاء إدخال موقع
tr: Lütfen bir konum girin

# createJob_remoteLabel
source: Remote Job
ar: وظيفة عن بُعد
tr: Uzaktan İş

# createJob_inclusiveLabel
source: Inclusive Opportunity
ar: فرصة شاملة
tr: Kapsayıcı Fırsat

# createJob_inclusiveSubtitle
source: This position is open to underrepresented groups
ar: هذا المنصب مفتوح للمجموعات الممثلة تمثيلاً ناقصاً
tr: Bu pozisyon yetersiz temsil edilen gruplara açıktır

# createJob_nonProfitLabel
source: Non-Profit / Volunteer Position
ar: منصب غير ربحي / تطوعي

# createJob_nonProfitSubtitle
source: This is a volunteer or non-profit position (no salary)
ar: هذا منصب غير ربحي أو تطوعي (سيتم تعطيل حقول الراتب)

# createJob_descriptionLabel
source: Job Description
ar: وصف الوظيفة
tr: İş Açıklaması

# createJob_descriptionRequiredError
source: Please enter a job description
ar: الرجاء إدخال وصف الوظيفة
tr: Lütfen bir iş açıklaması girin

# createJob_contactLabel
source: Contact Information (Email/Phone/Link)
ar: معلومات الاتصال (البريد الإلكتروني/الهاتف/الرابط)
tr: İletişim Bilgileri (E-posta/Telefon/Bağlantı)

# createJob_contactRequiredError
source: Please provide contact information
ar: الرجاء تقديم معلومات الاتصال
tr: Lütfen iletişim bilgilerini sağlayın

# createJob_minSalaryLabel
source: Minimum Salary (Optional)
ar: الحد الأدنى للراتب (اختياري)
tr: Minimum Maaş (İsteğe Bağlı)

# createJob_minSalaryPlaceholder
source: e.g., 50000
ar: مثل: 50000
tr: örn. 50000

# createJob_maxSalaryLabel
source: Maximum Salary (Optional)
ar: الحد الأقصى للراتب (اختياري)
tr: Maksimum Maaş (İsteğe Bağlı)

# createJob_maxSalaryPlaceholder
source: e.g., 70000
ar: مثل: 70000
tr: örn. 70000

# createJob_validNumberError
source: Please enter a valid whole number
ar: الرجاء إدخال رقم صحيح كامل
tr: Lütfen geçerli bir tam sayı girin

# createJob_ethicalPoliciesLabel
source: Ethical Policies Compliance
ar: الامتثال للسياسات الأخلاقية
tr: Etik Politikalar Uyumu

# createJob_policiesSelected
source: {count} selected
ar: {count} محدد

# jobDetails_alreadyApplied
source: You have already applied to this job.
ar: لقد تقدمت بالفعل لهذه الوظيفة.
tr: Bu işe zaten başvurdunuz.

# jobDetails_cvUploadFailed
source: Application submitted but CV upload failed: {error}
ar: تم تقديم الطلب ولكن فشل رفع السيرة الذاتية: {error}
tr: Başvuru gönderildi ancak CV yükleme başarısız: {error}

# jobDetails_applyErrorGeneric
source: Error applying: {error}
ar: خطأ في التقديم: {error}
tr: Başvuru hatası: {error}

# jobDetails_applyDialogTitle
source: Apply to Job
ar: التقديم للوظيفة
tr: İşe Başvur

# jobDetails_applyDialogMessage
source: You are applying for: {jobTitle}
ar: أنت تتقدم لـ: {jobTitle}
tr: Başvurduğunuz iş: {jobTitle}

# jobDetails_cvLabel
source: Upload CV *
ar: رفع السيرة الذاتية *
tr: CV Yükle *

# jobDetails_cvPlaceholder
source: Choose File (PDF, DOC, DOCX)
ar: اختر ملف (PDF, DOC, DOCX)
tr: Dosya Seç (PDF, DOC, DOCX)

# jobDetails_coverLetterLabel
source: Cover Letter (Optional)
ar: خطاب التغطية (اختياري)
tr: Ön Yazı (İsteğe Bağlı)

# jobDetails_coverLetterHint
source: Explain why you are a great fit for this position...
ar: اشرح لماذا أنت مناسب تماماً لهذا المنصب...
tr: Bu pozisyon için neden uygun olduğunuzu açıklayın...

# jobDetails_specialNeedsLabel
source: Special Needs or Accommodations (Optional)
ar: الاحتياجات الخاصة أو التسهيلات (اختياري)
tr: Özel İhtiyaçlar veya Düzenlemeler (İsteğe Bağlı)

# jobDetails_specialNeedsHint
source: e.g., Wheelchair accessibility, flexible hours...
ar: مثل: إمكانية الوصول للكراسي المتحركة، ساعات مرنة...
tr: örn. Tekerlekli sandalye erişimi, esnek saatler...

# jobDetails_specialNeedsMessage
source: This information will help employers accommodate your needs.
ar: ستساعد هذه المعلومات أصحاب العمل على تلبية احتياجاتك.
tr: Bu bilgi işverenlerin ihtiyaçlarınızı karşılamasına yardımcı olacaktır.

# jobDetails_cancelButton
source: Cancel
ar: إلغاء
tr: İptal

# jobDetails_submitButton
source: Submit Application
ar: تقديم الطلب
tr: Başvuruyu Gönder

# jobDetails_checkingStatus
source: Checking...
ar: جارٍ التحقق...
tr: Kontrol ediliyor...

# jobDetails_alreadyAppliedButton
source: Already Applied
ar: تم التقديم بالفعل
tr: Zaten Başvuruldu

# jobDetails_remote
source: Remote
ar: عن بُعد
tr: Uzaktan

# jobDetails_inclusiveOpportunity
source: Inclusive Opportunity
ar: فرصة شاملة
tr: Kapsayıcı Fırsat

# jobApplications_approveDialogTitle
source: Approve Application
ar: الموافقة على الطلب
tr: Başvuruyu Onayla

# jobApplications_rejectDialogTitle
source: Reject Application
ar: رفض الطلب
tr: Başvuruyu Reddet

# jobApplications_approveFeedbackPrompt
source: Provide feedback to the applicant (optional):
ar: تقديم تعليقات للمتقدم (اختياري):
tr: Başvurana geri bildirim sağlayın (isteğe bağlı):

# jobApplications_rejectFeedbackPrompt
source: Provide reason for rejection (optional):
ar: تقديم سبب الرفض (اختياري):
tr: Red nedeni sağlayın (isteğe bağlı):

# jobApplications_approveFeedbackHint
source: e.g., Great qualifications! We'll contact you soon.
ar: مثل: مؤهلات رائعة! سنتواصل معك قريباً.
tr: örn. Harika nitelikler! Yakında sizinle iletişime geçeceğiz.

# jobApplications_rejectFeedbackHint
source: e.g., We have selected other candidates at this time.
ar: مثل: لقد اخترنا مرشحين آخرين في هذا الوقت.
tr: örn. Şu anda başka adaylar seçtik.

# jobApplications_feedbackMessage
source: The applicant will see this feedback.
ar: سيرى المتقدم هذه التعليقات.
tr: Başvuran bu geri bildirimi görecek.

# jobApplications_cancelButton
source: Cancel
ar: إلغاء
tr: İptal

# jobApplications_approveButton
source: Approve
ar: موافقة
tr: Onayla

# jobApplications_rejectButton
source: Reject
ar: رفض
tr: Reddet

# jobApplications_approvedSuccess
source: Application approved successfully
ar: تمت الموافقة على الطلب بنجاح
tr: Başvuru başarıyla onaylandı

# jobApplications_rejectedSuccess
source: Application rejected
ar: تم رفض الطلب
tr: Başvuru reddedildi

# jobApplications_statusUpdatedSuccess
source: Application status updated
ar: تم تحديث حالة الطلب
tr: Başvuru durumu güncellendi

# jobApplications_appliedLabel
source: Applied: {date}
ar: تم التقديم: {date}
tr: Başvuru: {date}

# jobApplications_specialNeedsLabel
source: Special Needs: {needs}
ar: احتياجات خاصة: {needs}
tr: Özel İhtiyaçlar: {needs}

# jobApplications_cvLabel
source: CV Attached (tap to view)
ar: السيرة الذاتية مرفقة (اضغط للعرض)
tr: CV Ekli (görüntülemek için tıklayın)

# jobApplications_coverLetterLabel
source: Cover Letter
ar: خطاب التغطية
tr: Ön Yazı

# jobApplications_feedbackLabel
source: Feedback: {feedback}
ar: التعليقات: {feedback}
tr: Geri Bildirim: {feedback}

# jobApplications_downloadingCV
source: Downloading CV...
ar: جارٍ تنزيل السيرة الذاتية...
tr: CV indiriliyor...

# jobApplications_cvSaved
source: CV saved to {path}
ar: تم حفظ السيرة الذاتية في: {path}
tr: CV kaydedildi: {path}

# jobApplications_cvDownloadFailed
source: Failed to download CV: {error}
ar: فشل تنزيل السيرة الذاتية: {error}
tr: CV indirme başarısız: {error}

# jobApplications_noCVUploaded
source: No CV uploaded for this application
ar: لم يتم رفع سيرة ذاتية لهذا الطلب
tr: Bu başvuru için CV yüklenmedi

# jobApplications_viewCVBrowser
source: View CV in Browser
ar: عرض السيرة الذاتية في المتصفح
tr: CV'yi Tarayıcıda Görüntüle

# jobApplications_viewCVBrowserSubtitle
source: Open CV in your browser
ar: افتح السيرة الذاتية في متصفحك
tr: CV'yi tarayıcınızda açın

# jobApplications_cvOpenFailed
source: Unable to open CV. No app available to handle PDF files.
ar: تعذر فتح السيرة الذاتية. لا يوجد تطبيق متاح للتعامل مع ملفات PDF.
tr: CV açılamıyor. PDF dosyalarını işleyecek uygulama yok.

# jobApplications_cvOpenError
source: Error opening CV: {error}
ar: خطأ في فتح السيرة الذاتية: {error}
tr: CV açma hatası: {error}

# jobApplications_statusPending
source: Pending
ar: قيد الانتظار
tr: Beklemede

# jobApplications_statusApproved
source: Approved
ar: مقبول
tr: Onaylandı

# jobApplications_statusRejected
source: Rejected
ar: مرفوض
tr: Reddedildi

# jobApplications_downloadCV
source: Download CV
ar: تنزيل السيرة الذاتية
tr: CV İndir

# jobApplications_downloadCVSubtitle
source: Save CV to your device
ar: حفظ السيرة الذاتية على جهازك
tr: CV'yi cihazınıza kaydedin

# jobApplications_cvDownloadedSuccess
source: CV downloaded successfully {path}
ar: تم تنزيل السيرة الذاتية بنجاح {path}
tr: CV başarıyla indirildi {path}

# jobApplications_openButton
source: OPEN
ar: فتح
tr: AÇ

# ethicalPolicy_salary_transparency
source: Salary Transparency
ar: شفافية الرواتب

# ethicalPolicy_equal_pay_policy
source: Equal Pay Policy
ar: سياسة المساواة في الأجور

# ethicalPolicy_living_wage_employer
source: Living Wage Employer
ar: صاحب عمل بأجر معيشي

# ethicalPolicy_comprehensive_health_insurance
source: Comprehensive Health Insurance
ar: تأمين صحي شامل

# ethicalPolicy_performance_based_bonus
source: Performance-Based Bonus
ar: مكافأة على أساس الأداء

# ethicalPolicy_retirement_plan_support
source: Retirement Plan Support
ar: دعم خطة التقاعد

# ethicalPolicy_flexible_hours
source: Flexible Hours
ar: ساعات عمل مرنة

# ethicalPolicy_remote_friendly
source: Remote-Friendly
ar: صديق للعمل عن بُعد

# ethicalPolicy_no_after_hours_work_culture
source: No After-Hours Work Culture
ar: ثقافة عدم العمل بعد ساعات العمل

# ethicalPolicy_mental_health_support
source: Mental Health Support
ar: دعم الصحة النفسية

# ethicalPolicy_generous_paid_time_off
source: Generous Paid Time Off
ar: إجازة مدفوعة سخية

# ethicalPolicy_paid_parental_leave
source: Paid Parental Leave
ar: إجازة والدية مدفوعة

# ethicalPolicy_inclusive_hiring_practices
source: Inclusive Hiring Practices
ar: ممارسات توظيف شاملة

# ethicalPolicy_diverse_leadership
source: Diverse Leadership
ar: قيادة متنوعة

# ethicalPolicy_lgbtq_friendly_workplace
source: LGBTQ+ Friendly Workplace
ar: مكان عمل صديق لمجتمع LGBTQ+

# ethicalPolicy_disability_inclusive_workplace
source: Disability-Inclusive Workplace
ar: مكان عمل شامل لذوي الإعاقة

# ethicalPolicy_supports_women_in_leadership
source: Supports Women in Leadership
ar: يدعم النساء في القيادة

# ethicalPolicy_mentorship_program
source: Mentorship Program
ar: برنامج إرشاد

# ethicalPolicy_learning_development_budget
source: Learning & Development Budget
ar: ميزانية التعلم والتطوير

# ethicalPolicy_transparent_promotion_paths
source: Transparent Promotion Paths
ar: مسارات ترقية شفافة

# ethicalPolicy_internal_mobility
source: Internal Mobility
ar: التنقل الداخلي

# ethicalPolicy_sustainability_focused
source: Sustainability-Focused
ar: التركيز على الاستدامة

# ethicalPolicy_ethical_supply_chain
source: Ethical Supply Chain
ar: سلسلة توريد أخلاقية

# ethicalPolicy_community_volunteering
source: Community Volunteering
ar: التطوع المجتمعي

# ethicalPolicy_certified_b_corporation
source: Certified B-Corporation
ar: شركة B معتمدة
