Repository: bounswe/bounswe2025group4
Catalog: apps/jobboard-mobile/lib/l10n/app_*.arb
Languages: ar, tr

# welcomeScreen_stayMotivated
source: Stay motivated!
ar: ابق متحفزاً!
tr: Motive kalın!

# welcomeScreen_title
source: Welcome to Ethical Job Platform
ar: مرحباً بك في منصة الوظائف الأخلاقية
tr: Etik İş Platformuna Hoş Geldiniz

# welcomeScreen_subtitle
source: Connect with companies that share your values and build an ethical career path
ar: تواصل مع الشركات التي تشاركك قيمك وابنِ مساراً وظيفياً أخلاقياً
tr: Değerlerinizi paylaşan şirketlerle bağlantı kurun ve etik bir kariyer yolu oluşturun

# welcomeScreen_getStarted
source: Get Started
ar: ابدأ
tr: Başlayın

# welcomeScreen_alreadyHaveAccount
source: I already have an account
ar: لدي حساب بالفعل
tr: Zaten bir hesabım var

# signInScreen_title
source: Sign In
ar: تسجيل الدخول
tr: Giriş Yap

# signInScreen_welcomeBack
source: Welcome back!
ar: مرحباً بعودتك!
tr: Tekrar hoş geldiniz!

# signInScreen_username
source: Username
ar: اسم المستخدم
tr: Kullanıcı Adı

# signInScreen_password
source: Password
ar: كلمة المرور
tr: Şifre

# signInScreen_usernameRequired
source: Please enter your username
ar: الرجاء إدخال اسم المستخدم
tr: Lütfen kullanıcı adınızı girin

# signInScreen_passwordRequired
source: Please enter your password
ar: الرجاء إدخال كلمة المرور
tr: Lütfen şifrenizi girin

# signInScreen_signInButton
source: Sign In
ar: تسجيل الدخول
tr: Giriş Yap

# signInScreen_dontHaveAccount
source: Don't have an account?
ar: ليس لديك حساب؟
tr: Hesabınız yok mu?

# signInScreen_signUpLink
source: Sign Up
ar: إنشاء حساب
tr: Kayıt Ol

# signInScreen_loginFailed
source: Login Failed. Please check your credentials.
ar: فشل تسجيل الدخول. يرجى التحقق من بيانات الاعتماد الخاصة بك.
tr: Giriş Başarısız. Lütfen kimlik bilgilerinizi kontrol edin.

# signUpScreen_title
source: Sign Up
ar: إنشاء حساب
tr: Kayıt Ol

# signUpScreen_createAccount
source: Create your account
ar: أنشئ حسابك
tr: Hesabınızı oluşturun

# signUpScreen_username
source: Username
ar: اسم المستخدم
tr: Kullanıcı Adı

# signUpScreen_email
source: Email
ar: البريد الإلكتروني
tr: E-posta

# signUpScreen_password
source: Password
ar: كلمة المرور
tr: Şifre

# signUpScreen_confirmPassword
source: Confirm Password
ar: تأكيد كلمة المرور
tr: Şifreyi Onayla

# signUpScreen_bio
source: Bio
ar: السيرة الذاتية
tr: Biyografi

# signUpScreen_usernameRequired
source: Please enter a username
ar: الرجاء إدخال اسم المستخدم
tr: Lütfen bir kullanıcı adı girin

# signUpScreen_emailRequired
source: Please enter your email
ar: الرجاء إدخال بريدك الإلكتروني
tr: Lütfen e-posta adresinizi girin

# signUpScreen_emailInvalid
source: Please enter a valid email
ar: الرجاء إدخال بريد إلكتروني صالح
tr: Lütfen geçerli bir e-posta adresi girin

# signUpScreen_passwordRequired
source: Please enter a password
ar: الرجاء إدخال كلمة المرور
tr: Lütfen bir şifre girin

# signUpScreen_passwordTooShort
source: Password must be at least 8 characters
ar: يجب أن تتكون كلمة المرور من 8 أحرف على الأقل
tr: Şifre en az 6 karakter olmalıdır

# signUpScreen_passwordNoUppercase
source: Password must contain at least 1 uppercase letter
ar: يجب أن تحتوي كلمة المرور على حرف كبير واحد على الأقل
tr: Şifre büyük harf içermelidir

# signUpScreen_passwordNoLowercase
source: Password must contain at least 1 lowercase letter
ar: يجب أن تحتوي كلمة المرور على حرف صغير واحد على الأقل
tr: Şifre küçük harf içermelidir

# signUpScreen_passwordNoNumber
source: Password must contain at least 1 number
ar: يجب أن تحتوي كلمة المرور على رقم واحد على الأقل
tr: Şifre rakam içermelidir

# signUpScreen_passwordNoSpecialChar
source: Password must contain at least 1 special character.
ar: يجب أن تحتوي كلمة المرور على رمز خاص واحد على الأقل
tr: Şifre özel karakter içermelidir

# signUpScreen_confirmPasswordRequired
source: Please confirm your password
ar: الرجاء تأكيد كلمة المرور
tr: Lütfen şifrenizi onaylayın

# signUpScreen_male
source: Male
ar: ذكر
tr: Erkek

# signUpScreen_female
source: Female
ar: أنثى
tr: Kadın

# signUpScreen_other
source: Other
ar: آخر
tr: Diğer

# signUpScreen_gender
source: Gender
ar: الجنس
tr: Cinsiyet

# signUpScreen_passwordsDoNotMatch
source: Passwords do not match
ar: كلمات المرور غير متطابقة
tr: Şifreler eşleşmiyor

# signUpScreen_bioRequired
source: Please enter a bio
ar: الرجاء إدخال السيرة الذاتية
tr: Lütfen bir biyografi girin

# signUpScreen_signUpButton
source: Sign Up
ar: إنشاء حساب
tr: Kayıt Ol

# signUpScreen_alreadyHaveAccount
source: Already have an account?
ar: هل لديك حساب بالفعل؟
tr: Zaten hesabınız var mı?

# signUpScreen_signInLink
source: Sign In
ar: تسجيل الدخول
tr: Giriş Yap

# signUpScreen_userTypeMissing
source: User type missing. Please restart signup process.
ar: نوع المستخدم مفقود. يرجى إعادة بدء عملية التسجيل.
tr: Kullanıcı türü eksik. Lütfen kayıt işlemini yeniden başlatın.

# signUpScreen_signUpFailed
source: Sign up failed. Please try again later.
ar: فشل التسجيل. يرجى المحاولة مرة أخرى لاحقاً.
tr: Kayıt başarısız oldu. Lütfen daha sonra tekrar deneyin.

# signUpScreen_mentorProfileFailed
source: Failed to create mentor profile. Please try again or contact support.
ar: فشل إنشاء ملف المرشد. يرجى المحاولة مرة أخرى أو الاتصال بالدعم.
tr: Mentor profili oluşturulamadı. Lütfen tekrar deneyin veya destek ile iletişime geçin.

# signUpScreen_alreadyExists
source: Username or email already exists.
ar: اسم المستخدم أو البريد الإلكتروني موجود بالفعل.
tr: Kullanıcı adı veya e-posta zaten mevcut.

# signUpScreen_registrationFailed
source: Registration failed: {error}
ar: فشل التسجيل: {error}
tr: Kayıt başarısız oldu: {error}

# userTypeScreen_question
source: How will you use our platform?
ar: كيف ستستخدم منصتنا؟
tr: Platformumuzu nasıl kullanacaksınız?

# userTypeScreen_jobSeeker
source: Job Seeker
ar: الباحث عن عمل
tr: İş Arayan

# userTypeScreen_jobSeekerDesc
source: Find ethical companies and opportunities aligned with your values
ar: ابحث عن شركات وفرص أخلاقية تتوافق مع قيمك
tr: Değerlerinizle uyumlu etik şirketler ve fırsatlar bulun

# userTypeScreen_employer
source: Employer
ar: صاحب العمل
tr: İşveren

# userTypeScreen_employerDesc
source: Post jobs and find candidates who share your company's values
ar: انشر الوظائف وابحث عن المرشحين الذين يشاركون قيم شركتك
tr: İş ilanları yayınlayın ve şirketinizin değerlerini paylaşan adaylar bulun

# userTypeScreen_continue
source: Continue
ar: متابعة
tr: Devam Et

# mainScaffold_forum
source: Forum
ar: المنتدى

# mainScaffold_jobs
source: Jobs
ar: الوظائف
tr: İşler

# mainScaffold_mentorship
source: Mentorship
ar: الإرشاد
tr: Mentorluk

# mainScaffold_profile
source: Profile
ar: الملف الشخصي
tr: Profil

# mainScaffold_workplaces
source: Workplaces
ar: أماكن العمل
tr: İş Yerleri

# common_loading
source: Loading...
ar: جارٍ التحميل...
tr: Yükleniyor...

# common_error
source: Error
ar: خطأ
tr: Hata

# common_retry
source: Retry
ar: إعادة المحاولة
tr: Tekrar Dene

# common_cancel
source: Cancel
ar: إلغاء
tr: İptal

# common_save
source: Save
ar: حفظ
tr: Kaydet

# common_delete
source: Delete
ar: حذف
tr: Sil

# common_edit
source: Edit
ar: تعديل
tr: Düzenle

# common_search
source: Search
ar: بحث
tr: Ara

# common_ok
source: OK
ar: موافق
tr: Tamam

# common_yes
source: Yes
ar: نعم
tr: Evet

# common_no
source: No
ar: لا
tr: Hayır

# profilePage_title
source: My Profile
ar: ملفي الشخصي
tr: Profilim

# profilePage_editProfile
source: Edit profile
ar: تعديل الملف الشخصي
tr: Profili düzenle

# profilePage_logout
source: Logout
ar: تسجيل الخروج
tr: Çıkış Yap

# profilePage_failedToLoad
source: Failed to load profile
ar: فشل تحميل الملف الشخصي
tr: Profil yüklenemedi

# profilePage_fontSizeChanged
source: Font size changed to {size}
ar: تم تغيير حجم الخط إلى {size}
tr: Yazı boyutu {size} olarak değiştirildi

# profilePage_languageChanged
source: Language changed to {language}
ar: تم تغيير اللغة إلى {language}
tr: Dil {language} olarak değiştirildi

# careerStatusScreen_question
source: What is your current career status?
ar: ما هي حالتك المهنية الحالية؟
tr: Mevcut kariyer durumunuz nedir?

# careerStatusScreen_student
source: Student
ar: طالب
tr: Öğrenci

# careerStatusScreen_recentGraduate
source: Recent Graduate
ar: خريج حديث
tr: Yeni Mezun

# careerStatusScreen_midLevel
source: Mid-Level Professional
ar: محترف متوسط المستوى
tr: Orta Düzey Profesyonel

# careerStatusScreen_senior
source: Senior Professional
ar: محترف كبير
tr: Kıdemli Profesyonel

# careerStatusScreen_changingCareers
source: Changing Careers
ar: تغيير المهنة
tr: Kariyer Değişikliği Yapıyor

# organizationTypeScreen_question
source: What type of organization do you represent?
ar: ما نوع المنظمة التي تمثلها؟
tr: Ne tür bir organizasyonu temsil ediyorsunuz?

# organizationTypeScreen_company
source: Company
ar: شركة
tr: Şirket

# organizationTypeScreen_startup
source: Startup
ar: شركة ناشئة
tr: Girişim

# organizationTypeScreen_nonprofit
source: Non-profit
ar: غير ربحية
tr: Kar Amacı Gütmeyen

# organizationTypeScreen_freelancer
source: Freelancer hiring for a project
ar: مستقل يوظف لمشروع
tr: Proje için serbest çalışan arayan

# organizationTypeScreen_other
source: Other
ar: أخرى
tr: Diğer

# organizationTypeScreen_pleaseSpecify
source: Please specify
ar: يرجى التحديد
tr: Lütfen belirtin

# jobPrioritiesScreen_question
source: What are your top priorities when looking for a job?
ar: ما هي أهم أولوياتك عند البحث عن وظيفة؟
tr: İş ararken en önemli öncelikleriniz nelerdir?

# jobPrioritiesScreen_selectAll
source: Select all that apply
ar: حدد كل ما ينطبق
tr: Uygun olanların hepsini seçin

# jobPrioritiesScreen_fairWages
source: Fair Wages
ar: أجور عادلة
tr: Adil Ücretler

# jobPrioritiesScreen_fairWagesDesc
source: Companies that pay living wages and maintain transparent compensation practices
ar: الشركات التي تدفع أجوراً معيشية وتحافظ على ممارسات تعويض شفافة
tr: Yaşam ücreti ödeyen ve şeffaf ücret uygulamaları olan şirketler

# jobPrioritiesScreen_inclusive
source: Inclusive Workplace
ar: مكان عمل شامل
tr: Kapsayıcı İşyeri

# jobPrioritiesScreen_inclusiveDesc
source: Organizations committed to diversity, equity, and inclusion
ar: المنظمات الملتزمة بالتنوع والمساواة والشمول
tr: Çeşitlilik, eşitlik ve kapsayıcılığa bağlı organizasyonlar

# jobPrioritiesScreen_sustainability
source: Sustainability/Environmental Policies
ar: الاستدامة/السياسات البيئية
tr: Sürdürülebilirlik/Çevre Politikaları

# jobPrioritiesScreen_sustainabilityDesc
source: Companies with strong environmental commitments and practices
ar: الشركات ذات الالتزامات والممارسات البيئية القوية
tr: Güçlü çevre taahhütleri ve uygulamaları olan şirketler

# jobPrioritiesScreen_workLife
source: Work-Life Balance
ar: التوازن بين العمل والحياة
tr: İş-Yaşam Dengesi

# jobPrioritiesScreen_workLifeDesc
source: Respectful of personal time with flexible scheduling options
ar: احترام الوقت الشخصي مع خيارات جدولة مرنة
tr: Esnek çalışma seçenekleriyle kişisel zamana saygılı

# jobPrioritiesScreen_remote
source: Remote-Friendly
ar: صديق للعمل عن بُعد
tr: Uzaktan Çalışma Dostu

# jobPrioritiesScreen_remoteDesc
source: Options for remote work and flexible location
ar: خيارات للعمل عن بُعد والموقع المرن
tr: Uzaktan çalışma ve esnek konum seçenekleri

# jobPrioritiesScreen_growth
source: Career Growth Opportunities
ar: فرص النمو الوظيفي
tr: Kariyer Gelişim Fırsatları

# jobPrioritiesScreen_growthDesc
source: Clear paths for advancement and professional development
ar: مسارات واضحة للتقدم والتطوير المهني
tr: İlerleme ve profesyonel gelişim için net yollar

# companyPoliciesScreen_question
source: Which ethical policies does your company follow?
ar: ما هي السياسات الأخلاقية التي تتبعها شركتك؟
tr: Şirketiniz hangi etik politikaları takip ediyor?

# companyPoliciesScreen_fairWage
source: Fair wage commitment
ar: التزام الأجور العادلة
tr: Adil ücret taahhüdü

# companyPoliciesScreen_fairWageDesc
source: Ensuring competitive compensation and transparent pay practices
ar: ضمان تعويض تنافسي وممارسات دفع شفافة
tr: Rekabetçi ücretlendirme ve şeffaf ödeme uygulamaları

# companyPoliciesScreen_diversity
source: Diversity & inclusion policy
ar: سياسة التنوع والشمول
tr: Çeşitlilik ve kapsayıcılık politikası

# companyPoliciesScreen_diversityDesc
source: Promoting an inclusive workplace with equal opportunities
ar: تعزيز مكان عمل شامل مع فرص متساوية
tr: Eşit fırsatlarla kapsayıcı bir işyeri teşvik etme

# companyPoliciesScreen_wellbeing
source: Employee well-being programs
ar: برامج رفاهية الموظفين
tr: Çalışan refahı programları

# companyPoliciesScreen_wellbeingDesc
source: Supporting mental health, work-life balance, and personal growth
ar: دعم الصحة النفسية والتوازن بين العمل والحياة والنمو الشخصي
tr: Ruh sağlığı, iş-yaşam dengesi ve kişisel gelişimi destekleme

# companyPoliciesScreen_remotePolicy
source: Remote-friendly culture
ar: ثقافة صديقة للعمل عن بُعد
tr: Uzaktan çalışma dostu kültür

# companyPoliciesScreen_remotePolicyDesc
source: Offering flexible work arrangements and remote options
ar: تقديم ترتيبات عمل مرنة وخيارات عن بُعد
tr: Esnek çalışma düzenlemeleri ve uzaktan seçenekler sunma

# companyPoliciesScreen_sustainabilityPolicy
source: Sustainability/environmental goals
ar: أهداف الاستدامة/البيئة
tr: Sürdürülebilirlik/çevre hedefleri

# companyPoliciesScreen_sustainabilityPolicyDesc
source: Implementing eco-friendly practices and reducing environmental impact
ar: تنفيذ ممارسات صديقة للبيئة وتقليل التأثير البيئي
tr: Çevre dostu uygulamalar ve çevresel etkileri azaltma

# industrySelectionScreen_question
source: Which industries are you most interested in?
ar: ما هي الصناعات الأكثر اهتماماً بها؟
tr: Hangi sektörlerle en çok ilgileniyorsunuz?

# industrySelectionScreen_tech
source: Tech
ar: التكنولوجيا
tr: Teknoloji

# industrySelectionScreen_healthcare
source: Healthcare
ar: الرعاية الصحية
tr: Sağlık

# industrySelectionScreen_education
source: Education
ar: التعليم
tr: Eğitim

# industrySelectionScreen_finance
source: Finance
ar: المالية
tr: Finans

# industrySelectionScreen_creativeArts
source: Creative Arts
ar: الفنون الإبداعية
tr: Yaratıcı Sanatlar

# mentorshipSelectionScreen_question
source: Would you like to participate in our mentorship system?
ar: هل ترغب في المشاركة في نظام الإرشاد لدينا؟
tr: Mentorluk sistemimize katılmak ister misiniz?

# mentorshipSelectionScreen_subtitle
source: You can connect with others to either receive or provide career guidance.
ar: يمكنك التواصل مع الآخرين لتلقي أو تقديم التوجيه المهني.
tr: Kariyer rehberliği almak veya sağlamak için başkalarıyla bağlantı kurabilirsiniz.

# mentorshipSelectionScreen_beMentor
source: I want to be a mentor
ar: أريد أن أكون مرشداً
tr: Mentor olmak istiyorum

# mentorshipSelectionScreen_beMentorDesc
source: Help others improve their resumes and careers
ar: ساعد الآخرين على تحسين سيرهم الذاتية ومساراتهم المهنية
tr: Başkalarının özgeçmişlerini ve kariyerlerini geliştirmelerine yardımcı olun

# mentorshipSelectionScreen_lookingForMentor
source: I'm looking for a mentor (mentee)
ar: أبحث عن مرشد (متدرب)
tr: Mentor arıyorum (mentee)

# mentorshipSelectionScreen_lookingForMentorDesc
source: Get feedback and guidance to grow professionally
ar: احصل على ملاحظات وإرشادات للنمو مهنياً
tr: Profesyonel olarak büyümek için geri bildirim ve rehberlik alın

# mentorshipSelectionScreen_maxMentees
source: How many mentees are you willing to take?
ar: كم عدد المتدربين الذين ترغب في قبولهم؟
tr: Kaç mentee almaya hazırsınız?

# mentorshipSelectionScreen_maxMenteesLabel
source: Max Mentee Count (1-20)
ar: الحد الأقصى لعدد المتدربين (1-20)
tr: Maksimum Mentee Sayısı (1-20)

# mentorshipSelectionScreen_enterNumber
source: Please enter a number
ar: الرجاء إدخال رقم
tr: Lütfen bir sayı girin

# mentorshipSelectionScreen_validNumber
source: Please enter a valid number
ar: الرجاء إدخال رقم صحيح
tr: Lütfen geçerli bir sayı girin

# mentorshipSelectionScreen_greaterThanZero
source: Must be greater than 0
ar: يجب أن يكون أكبر من 0
tr: 0'dan büyük olmalıdır

# mentorshipSelectionScreen_lessThan21
source: Must be less than 21
ar: يجب أن يكون أقل من 21
tr: 21'den küçük olmalıdır

# jobPage_title
source: Jobs
ar: الوظائف
tr: İşler

# jobPage_search
source: Search jobs...
ar: البحث عن وظائف...
tr: İş ara...

# jobPage_filter
source: Filter
ar: تصفية
tr: Filtrele

# jobPage_createJob
source: Create Job Post
ar: إنشاء إعلان وظيفة
tr: İş İlanı Oluştur

# jobPage_myApplications
source: My Applications
ar: طلباتي
tr: Başvurularım

# jobPage_viewApplications
source: View Applications
ar: عرض الطلبات
tr: Başvuruları Görüntüle

# jobPage_noJobs
source: No jobs found
ar: لم يتم العثور على وظائف
tr: İş ilanı bulunamadı

# jobPage_loadError
source: Failed to load jobs. Please try again.
ar: فشل تحميل الوظائف. يرجى المحاولة مرة أخرى.
tr: İşler yüklenemedi. Lütfen tekrar deneyin.

# jobPage_posted
source: Posted
ar: نُشر
tr: Yayınlandı

# jobPage_remote
source: Remote
ar: عن بُعد
tr: Uzaktan

# jobPage_yourPostedJobs
source: Your Posted Jobs
ar: الوظائف التي نشرتها
tr: Yayınladığınız İşler

# jobPage_noPostedJobs
source: You have not posted any jobs yet.
ar: لم تنشر أي وظائف بعد.
tr: Henüz iş ilanı yayınlamadınız.

# jobDetails_title
source: Job Details
ar: تفاصيل الوظيفة
tr: İş Detayları

# jobDetails_apply
source: Apply Now
ar: قدم الآن
tr: Şimdi Başvur

# jobDetails_loadError
source: Failed to load job details. Please try again.
ar: فشل تحميل تفاصيل الوظيفة. يرجى المحاولة مرة أخرى.
tr: İş detayları yüklenemedi. Lütfen tekrar deneyin.

# jobDetails_applyError
source: Error: Could not identify user.
ar: خطأ: تعذر تحديد المستخدم.
tr: Hata: Kullanıcı tanımlanamadı.

# jobDetails_applySuccess
source: Successfully applied to {jobTitle}
ar: تم التقديم بنجاح إلى {jobTitle}
tr: {jobTitle} pozisyonuna başarıyla başvuruldu

# jobDetails_company
source: Company
ar: الشركة
tr: Şirket

# jobDetails_location
source: Location
ar: الموقع
tr: Konum

# jobDetails_salary
source: Salary
ar: الراتب
tr: Maaş

# jobDetails_description
source: Description
ar: الوصف
tr: Açıklama

# jobDetails_requirements
source: Requirements
ar: المتطلبات
tr: Gereksinimler

# jobDetails_ethicalTags
source: Ethical Tags
ar: العلامات الأخلاقية
tr: Etik Etiketler

source: Job details not found.
ar: لم يتم العثور على تفاصيل الوظيفة.
tr: İş detayları bulunamadı.

# jobDetails_noTags
source: No specific tags listed.
ar: لا توجد علامات محددة.
tr: Belirli etiket yok.

# jobDetails_salaryRange
source: Salary Range
ar: نطاق الراتب
tr: Maaş Aralığı

# jobDetails_contactInfo
source: Contact Information
ar: معلومات الاتصال
tr: İletişim Bilgileri

# jobDetails_applying
source: Applying...
ar: جارٍ التقديم...
tr: Başvuruluyor...

# forumPage_title
source: Forum
ar: المنتدى

# forumPage_loadError
source: Failed to load Forum: Please check your connection and try again.
ar: فشل تحميل المنتدى: يرجى التحقق من اتصالك والمحاولة مرة أخرى.
tr: Forum yüklenemedi: Lütfen bağlantınızı kontrol edip tekrar deneyin.

# forumPage_noDiscussions
source: No discussions yet
ar: لا توجد مناقشات بعد
tr: Henüz tartışma yok

# forumPage_filter
source: Filter
ar: تصفية
tr: Filtrele

# forumPage_searchTags
source: Search tags
ar: البحث عن العلامات
tr: Etiket ara

# forumPage_reset
source: Reset
ar: إعادة تعيين
tr: Sıfırla

# createThread_newTitle
source: New Discussion
ar: مناقشة جديدة
tr: Yeni Tartışma

# createThread_editTitle
source: Edit Discussion
ar: تعديل المناقشة
tr: Tartışmayı Düzenle

# createThread_titleLabel
source: Title
ar: العنوان
tr: Başlık

# createThread_titleRequired
source: Please enter a title
ar: الرجاء إدخال عنوان
tr: Lütfen bir başlık girin

# createThread_titleMaxLength
source: Title must be at most 100 characters
ar: يجب أن يكون العنوان 100 حرف على الأكثر
tr: Başlık en fazla 100 karakter olmalıdır

# createThread_bodyLabel
source: What's on your mind?
ar: ما الذي يدور في ذهنك؟
tr: Aklınızdan ne geçiyor?

# createThread_bodyRequired
source: Please enter content
ar: الرجاء إدخال المحتوى
tr: Lütfen içerik girin

# createThread_tags
source: Tags
ar: العلامات
tr: Etiketler

# createThread_selectTags
source: Select Tags
ar: اختر العلامات
tr: Etiket Seç

# createThread_suggestTags
source: Suggest Tags
ar: اقترح العلامات
tr: Etiket Öner

# createThread_enterTitleForSuggestions
source: Please enter a title to get tag suggestions.
ar: الرجاء إدخال عنوان للحصول على اقتراحات العلامات.
tr: Etiket önerileri almak için lütfen bir başlık girin.

# createThread_addNewTag
source: Add a new tag
ar: إضافة علامة جديدة
tr: Yeni etiket ekle

# createThread_tagEmpty
source: Tag name cannot be empty.
ar: اسم العلامة لا يمكن أن يكون فارغًا.
tr: Etiket adı boş olamaz.

# createThread_tagMaxLength
source: Tag name must be at most 255 characters.
ar: يجب أن يكون اسم العلامة 255 حرفًا على الأكثر.
tr: Etiket adı en fazla 255 karakter olmalıdır.

# createThread_done
source: Done
ar: تم
tr: Tamam

# createThread_post
source: Post
ar: نشر
tr: Gönder

# createThread_save
source: Save
ar: حفظ
tr: Kaydet

# createThread_createError
source: Failed to create/edit discussion. Please check your connection.
ar: فشل إنشاء/تعديل المناقشة. يرجى التحقق من اتصالك.
tr: Tartışma oluşturma/düzenleme başarısız. Lütfen bağlantınızı kontrol edin.

# createThread_generalError
source: Failed to create/edit discussion.
ar: فشل إنشاء/تعديل المناقشة.
tr: Tartışma oluşturma/düzenleme başarısız.

# threadDetail_report
source: Report
ar: إبلاغ
tr: Bildir

# threadDetail_edit
source: Edit
ar: تعديل
tr: Düzenle

# threadDetail_delete
source: Delete
ar: حذف
tr: Sil

# threadDetail_reported
source: Discussion reported
ar: تم الإبلاغ عن المناقشة
tr: Tartışma bildirildi

# threadDetail_connectionError
source: Failed: Please check your connection and refresh the page.
ar: فشل: يرجى التحقق من اتصالك وتحديث الصفحة.
tr: Başarısız: Lütfen bağlantınızı kontrol edip sayfayı yenileyin.

# threadDetail_unavailable
source: Failed: This discussion is no longer available.
ar: فشل: هذه المناقشة لم تعد متاحة.
tr: Başarısız: Bu tartışma artık mevcut değil.

# threadDetail_deleteError
source: Failed to delete discussion.
ar: فشل حذف المناقشة.
tr: Tartışma silinemedi.

# threadDetail_threadDetails
source: Thread Details
ar: تفاصيل المناقشة
tr: Tartışma Detayları

# threadDetail_creator
source: Creator:
ar: المُنشئ:
tr: Oluşturan:

# threadDetail_content
source: Content:
ar: المحتوى:
tr: İçerik:

# threadDetail_tags
source: Tags:
ar: العلامات:
tr: Etiketler:

# threadDetail_created
source: Created: {date}
ar: تم الإنشاء: {date}
tr: Oluşturulma: {date}

# threadDetail_edited
source: Edited: {date}
ar: تم التعديل: {date}
tr: Düzenleme: {date}

# threadDetail_comments
source: Comments
ar: التعليقات
tr: Yorumlar

# threadDetail_addComment
source: Add a comment…
ar: أضف تعليقاً…
tr: Yorum ekle…

# threadDetail_commentRequired
source: Please enter a comment
ar: الرجاء إدخال تعليق
tr: Lütfen bir yorum girin

# threadDetail_deleteCommentError
source: Failed to delete comment.
ar: فشل حذف التعليق.
tr: Yorum silinemedi.

# mentorshipPage_title
source: Mentorship
ar: الترابط المهني
tr: Mentorluk

# mentorshipPage_loginRequired
source: Please log in to access mentorship features.
ar: الرجاء تسجيل الدخول للوصول إلى ميزات الترابط المهني.
tr: Mentorluk özelliklerine erişmek için lütfen giriş yapın.

# mentorScreen_title
source: Mentorship
ar: الترابط المهني
tr: Mentorluk

# mentorScreen_currentMentees
source: Current Mentees
ar: المنتسبون الحاليون
tr: Mevcut Mentiler

# mentorScreen_requests
source: Requests
ar: الطلبات
tr: Talepler

# mentorScreen_currentCapacity
source: Current Capacity: {capacity}
ar: السعة الحالية: {capacity}
tr: Mevcut Kapasite: {capacity}

# mentorScreen_updateCapacity
source: Update Capacity
ar: تحديث السعة
tr: Kapasiteyi Güncelle

# mentorScreen_noCurrentMentees
source: No current mentees
ar: لا يوجد منتسبون حاليون
tr: Mevcut menti yok

# mentorScreen_noPendingRequests
source: No pending requests
ar: لا توجد طلبات معلقة
tr: Bekleyen talep yok

# mentorScreen_capacityUpdated
source: Capacity updated successfully
ar: تم تحديث السعة بنجاح
tr: Kapasite başarıyla güncellendi
